package com.example.hw

object CatRepository {

    val list : List<Cat> = listOf(
        Cat(
            0,
            "Абиссинская",
            "Абиссинская порода — это элегантные кошки средних размеров с сильными грациозными телами и длинными стройными лапами. Для этой породы характерны округлая клиновидная форма головы с большими миндалевидными глазами и уши с небольшими кисточками на кончиках. Короткая прилегающая шерсть абиссинской кошки отличается тикингом — смешением цветов на каждом из волосков. Наиболее популярный окрас — «дикий» (ruddy), но также встречаются и другие виды.",
        "https://www.purina.ru/sites/default/files/styles/nppe_breed_selector_500/public/2020-04/cat_abyssinian_0.jpg?itok=ZVHMdIdD"
        ),
        Cat(
            1,
            "Американская жесткошерстная кошка",
            "О шерсти американской жесткошерстной кошки можно судить по названию породы. Американская жесткошерстная — это кошка крупного размера с грубой и упругой на ощупь шерстью. Короткие и средние волоски на теле этого животного образуют волны или жесткие завитушки. У этих кошек часто бывают кудрявые бакенбарды. Степень жесткошерстности у животных проявляется только во взрослом возрасте: котята с очень кудрявой шерстью могут получить волнистую шубку, и наоборот. У жесткошерстной кошки могут быть любые окрасы, рисунки пятен и отметины.",
            "https://www.purina.ru/sites/default/files/styles/nppe_breed_selector_500/public/2020-11/american_wirehair_500%D1%85473_02.png?itok=IWvfsMP_"
        ),
        Cat(
            2,
            "Азиатская кошка",
            "Азиатские кошки отличаются длинным мускулистым телом среднего размера и хвостом, сужающимся к круглому кончику. Самки азиатской кошки намного меньше и изящнее по сравнению с самцами. Голова имеет клиновидную форму со слегка скругленным конусом. Уши — широко посаженные, среднего размера. Глаза — большие с серебристым окаймлением. Шерсть, похожая на мокрый шелк, — короткая, красивая и близко прилегает к телу. В этой группе представлены кошки различных окрасов и вариантов пятнистости.",
            "https://www.purina.ru/sites/default/files/styles/nppe_breed_selector_500/public/2020-04/cat_asian.jpg?itok=UL4DHN-j"
        ),
        Cat(
            3,
            "Австралийский мист",
            "Австралийский мист — порода короткошерстных кошек среднего размера с округлой головой и большими выразительными глазами разных оттенков зеленого. Австралийские мисты не имеют каких-либо экстраординарных характеристик: они небольшого размера, со средней толщиной костей и дружелюбным выражением глаз. Шерсть имеет темный фон с наличием тикинга (зонарного окрашивания волосков), поэтому создается впечатление дымки (mist). Этому также способствует пятнистость — окрас в виде пятен или завитков, напоминающих мрамор. Ноги и хвост этих кошек — полосатые и окрашены кольцами, а морда — линиями. Австралийские мисты бывают коричневого, голубого, шоколадного, лилового, карамельного, золотистого и кремового окрасов.",
            "https://www.purina.ru/sites/default/files/styles/nppe_breed_selector_500/public/2020-04/cat_australian_mist.jpg?itok=aI-KStCE"
        )
    )
}